CSI API ETABS v1
cCaseStaticNonlinear.GetResultsSaved Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetResultsSaved(
	string Name,
	ref bool SaveMultipleSteps,
	ref int MinSavedStates,
	ref int MaxSavedStates,
	ref bool PositiveOnly
)
Function GetResultsSaved (
	Name As String,
	ByRef SaveMultipleSteps As Boolean,
	ByRef MinSavedStates As Integer,
	ByRef MaxSavedStates As Integer,
	ByRef PositiveOnly As Boolean
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim SaveMultipleSteps As Boolean
Dim MinSavedStates As Integer
Dim MaxSavedStates As Integer
Dim PositiveOnly As Boolean
Dim returnValue As Integer
returnValue = instance.GetResultsSaved(Name,
	SaveMultipleSteps, MinSavedStates,
	MaxSavedStates, PositiveOnly)
int GetResultsSaved(
	String^ Name,
	bool% SaveMultipleSteps,
	int% MinSavedStates,
	int% MaxSavedStates,
	bool% PositiveOnly
)
abstract GetResultsSaved :
        Name : string *
        SaveMultipleSteps : bool byref *
        MinSavedStates : int byref *
        MaxSavedStates : int byref *
        PositiveOnly : bool byref -> int
Parameters
Name
Type: System.String
SaveMultipleSteps
Type: System.Boolean
MinSavedStates
Type: System.Int32
MaxSavedStates
Type: System.Int32
PositiveOnly
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace